Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: |, &, ^, <<, >>: You can perform bitwise operations with these, where | = bitwise or, & = bitwise and, ^ = bitwise xor, << = shift left, >> = shift right.
zh_cn: |, &, ^, <<, >>：你可以使用这些进行位运算， | = 位运算“或”，& = 位运算“与”， ^ = 位运算“异或”， << = 左移， >> = 右移。

source: You cannot update assets that have already been uploaded unless the updated package is signed using the same certificate that the original was created with.
zh_cn: 除非使用之前创建的相同的证书，你不能已经上传的资源。.

source: This will open a window similar to the one above.
zh_cn: 这将会打开如上窗口。

source: <Optional> The horizontal scaling factor (use -1 to reset to default).
zh_cn: <可选> 水平缩放因数（使用-1重置为默认）

source: <Optional> The vertical scaling factor (use -1 to reset to default).
zh_cn: <可选> 垂直缩放因数（使用-1重置为默认）。

source: <Optional> The x offset position for drawing.
zh_cn: <Optional> 偏移x位置进行绘制

source: <Optional> The y offset position for drawing.
zh_cn: <Optional> 偏移y位置进行绘制

source: GameMaker Studio 2 Versions
zh_cn: GameMaker Studio 2 版本

source: GameMaker Studio 2 accepts WAV, MP3 and OGG format files.
zh_cn: GameMaker Studio 2 兼容 WAV、 MP3 和 OGG 格式的声音文件。

source: GameMaker Studio 2 can also be used in a college environment.
zh_cn: GameMaker Studio 2 也可以使用于大学教育。

source: GameMaker Studio 2 comes as a Free version to start with, and then you can buy different upgrades depending on your needs.
zh_cn: GameMaker Studio 2 最开始是以试用版许可信息启动的，而后你可以依据你的需求购买升级包。

source: GameMaker Studio 2 comes with a Trial Licence to start with, and then you can buy different upgrades depending on your needs.
zh_cn: GameMaker Studio 2 最开始是以试用版许可信息启动的，而后你可以依据你的需求购买升级包。

source: GameMaker Studio 2 devs often use the function place_free(), and then when a collision is found, try to slowly move the object out by either looping around an x or y position (or something) while continuing to execute that function, or by using the move_outside_all() function.
zh_cn: GameMaker Studio 2 的开发者们经常使用 place_free() 函数，当发生碰撞时，尝试通过在 x 或 y位置(或其他位置)上循环缓慢移动对象，同时继续执行该函数，或者使用更为方便的 move_outside_all() 函数。

source: GameMaker Studio 2 is a tool designed to empower you and your team to make new and innovative games as well as prototype ideas in the fastest and most intuitive way possible across multiple target platforms.
zh_cn: GameMaker Studio 2 是一个游戏开发工具， 旨在让您和您的团队根据游戏设计的思路以最快，最直观的方式制作游戏，并且能跨平台开发。

source: GameMaker Studio 2 is innovative in a number of ways as you'll see, so we hope that this section will give you enough knowledge to dive in and get started without too many issues...
zh_cn: 正如你所见，GameMaker Studio 2 在许多方面都具有创新性，因此我们希望这部分能够向你提供足够的知识，以深入了解GMS2并开始工作，而不会遇到太多问题...

source: GameMaker Studio 2 is more than just an IDE and has a number of different runtime tools that it uses behind the scenes to build you games for the different target platforms available.
zh_cn: GameMaker Studio 2不仅有一个IDE，还有一些在幕后运作的不同的运行工具来将你的游戏构建到各种可用平台上。

source: GameMaker Studio 2 itself has no special requirements other than those listed on the Installing page and will install any required dependencies the first time you install the product as part of the package.
zh_cn: GameMaker Studio 2 除了那些列举在安装页面里的东西外本身没有什么特殊要求，并且一旦你安装了本产品的会安装任何要求的依赖项作为包的一部分。

source: GameMaker Studio 2 permits you to specify what type of project it is that you wish to create, and you can pick and choose based on your coding knowledge or habits.
zh_cn: GameMaker Studio 2 允许您指定希望创建的项目类型，你可以根据你的编码知识或习惯来选择。

source: GameMaker Studio 2 splits game time into steps with the game speed defining how many of these steps there are supposed to be per second.
zh_cn: GameMaker Studio 2 将游戏时间分成若干个 步，游戏速度定义了每秒应该执行的步数量。

source: GameMaker Studio 2 stores images, sounds, scripts etc... between use in a cache so as to save time when testing your game as it will only re-compile those things that have been changed before testing.
zh_cn: GameMaker Studio 2 将图像，声音，脚本等存储在缓存中，以便在测试游戏时节省时间，因此它只会在测试之前重新编译已更改的内容。

source: GameMaker Studio 2 works with cycles of these events - from the moment a room is started to the moment it is finished there is a game loop running where every step (a step is a moment in game time, governed by the room speed setting) a series of events are run or checked, and you can choose to place code or DnD actions in your objects that respond to these events.
zh_cn: GameMaker Studio 2 适用于这些事件的周期 - 从房间开始到完成之时，每个步骤（一步是在游戏时间的一瞬间，由房间速度设置控制），一系列事件被运行或检查，您可以选择将代码或DnD操作放置在响应这些事件的对象中。

source: We won't go into too much depth about the tools available here - for that we have the Image Editor section of the manual - but briefly you have:
zh_cn: 我们不会深入介绍这里所提供的工具 - 在手册中的 图像编辑器 部分有详细说明 - 但是会简要说明一下：

source: GameMaker Studio 2 can have several different runtime tools installed at any one time and you can set which one to use from this preference.
zh_cn: GameMaker Studio 2 可以在任何一个时间安装几个不同的运行库工具，并且你可以从偏好设置中设置使用哪一个。

source: GameMaker Studio 2 works with cycles of these events - from the moment a room is started to the moment it is finished there is a game loop running where every step (a step is a moment in game time, governed by the game speed setting) a series of events are run, and you can choose to place code or DnD™ actions in your instances that respond to these events.
zh_cn: GameMaker Studio 2 根据这些事件组成的循环来进行工作 - 一个房间从开始到完成，即为一个游戏循环运行，每一步（游戏时间的一个步骤，由游戏速度控制） 一系列事件将会运行，您可以选择将代码或拖放模块放入响应这些事件的实例中。

source: The above image has two views with two view ports, each one drawn at different positions.
zh_cn: 上面的图片输出了两个视野，每一个绘制在不同的位置。

source: You can add a resource to the resource tree by right clicking on it and selecting the Create option from the pop-up menu (for full details on this pop-up menu, see below).
zh_cn: 您可以通过右键单击 资源树来添加资源，然后从弹出菜单中选择 创建 选项（有关此弹出菜单的详细信息，请参阅下文）。

source: NOTE: If you have resized the game window (for example, by switching from full screen to windowed), and wish to center the new window, this function should be called in an alarm[0] at least one step later than the window size change, otherwise it will not work correctly.
zh_cn: 注： 如果你已经在重置游戏窗口大小（例如切换全屏到窗口），并且希望新的窗口屏幕居中，你应该使用一个alarm[0]（计时器） 来调用这个函数，至少在窗口更改 one step（一步）之后，否则可能会出现问题。

source: GameMaker Studio 2 supports the following shader languages:
zh_cn: GameMaker Studio 2 支持以下着色器语言：

source: If you check the box marked Remember Packaging Option then GameMaker Studio 2 will remember the choice for all future compiles (this can be reset or changed from the Windows Preferences).
zh_cn: 在 Windows 的编译选项中如果选中标记为 记住打包选项 的框，则 GameMaker Studio 2 将记住所有关于编译器的选择（可以在 Windows 首选项 重置或更改）。

source: NOTE: This function is only valid for the HTML5, Windows, MacOS, Windows 8 (JS), and Tizen (JS) modules.
zh_cn: 注意：该函数仅适用于HTML5、Windows、MacOS、Windows 8 (JS)以及Tizen (JS)模块。

source: <new path>
zh_cn: <新建路径>

source: <no background>
zh_cn: <无背景>

source: <statement>;
zh_cn: <语句>;

source: MP3 and OGG files should be used for background music or any effect that plays over a longer period of time or that has a rather large file size.
zh_cn: MP3 和 OGG 格式的文件则适合存储背景音乐以及一些需要长时间播放的声音。

source: <variable> = <expression>;
zh_cn: <变量> = <表达式>;

source: A 2D array needs to be initialised before use, the same as a 1D array, and can hold real numbers, strings and constants, just like any other variable, making them ideal candidates for any game that needs to store large amounts of data in an easily accessible way (remember, you can loop through an array easily).
zh_cn: 二维数组在使用前同样也需要初始化，和其它的变量一样，也可以存储实数、字符串和常量。在需要便捷地储存大量数据时，二维数组是一个理想的选择（记住，数组中循环非常方便）。

source: A Remote Worker with this name already exists.
zh_cn: 已存在具有此名称的远程工作者。

source: A Runtime download is already in progress.
zh_cn: 运行库下载已经在进行中。

source: A basic game in GameMaker Studio 2 will require a room to run in, and usually at least one object and a sprite, although you'll likely use a lot more!
zh_cn: GameMaker Studio 2 中的游戏至少需要一个房间来运行，至少存在一个物体和一个精灵，当然你不止会使用一个！

source: A boolean is simply a value that can either be true or false.
zh_cn: 布尔值可以是true或false。

source: A branch to execute in a switch if the case is true.
zh_cn: Switch分支中当满足情形时所执行的分支。

source: A breakpoint is a place in your game code that you wish it to stop at so you can see what's going on.
zh_cn: 断点是你游戏代码中你需要暂停的地方，这样你就能观察到底发生了什么。

source: A breakpoint is a point in the game loop where you want the debug module to pause and let you step through the actual game code a line at a time.
zh_cn: 断点是游戏循环中您希望调试模块暂停，并让您手动遍历实际游戏代码的一个点。

source: A brief description of the data being stored.
zh_cn: 所存储数据的简要说明。

source: A conflict was encountered, but the gamer chose to ignore it
zh_cn: 遇到冲突,但玩家选择忽略它。

source: A default switch case for when no other case is matched.
zh_cn: 当没有其他情形匹配时的默认情形。

source: A dimension input has been set along with both the associated anchors
zh_cn: 已经设置了一个维度的输入，连同关联的锚点A dimension input has been set along with both the associated anchors

source: A dimension input has been set along with both the associated anchors, the dimension input will be ignored
zh_cn: 大小已经设置与关联的锚点一致，大小的输入将被忽略。

source: A duplicate of stylename '{0}' was found in\n'{1}'\nthe style will continue to be saved in\n'{2}'
zh_cn: 样式名为“{0}”的副本被发现在\n'{1}'\n样式将继续保存在\n'{2}'

source: A file with the same name already exists.
zh_cn: 同名文件已经存在。

source: A function has been given the wrong number of arguments when a certain number were expected
zh_cn: 函数的参数数量错误

source: A general description of what the script does.
zh_cn: 关于脚本的总体描述

source: A generic loop that continues until a Break action is hit.
zh_cn: 遇到跳出动作（Break）之前会持续执行的常规循环。

source: A gesture event (Tap, Drag, Flick, Pinch or Rotate)
zh_cn: 手势事件（轻敲、拖动、划动、捏合或旋转）

source: A great many things are different between GameMaker Studio 2 and GameMaker Studio 2 1.4, and so your older projects may need some tweaking for them to work.
zh_cn: GameMaker Studio 2和 GameMaker Studio 1.4之间存在很多差异，因此你的旧版项目可能需要一些调整之后才能运作。

source: A great many things are different between GameMaker Studio 2 and GameMaker: Studio 1.4, and so your older projects may need some tweaking for them to work.
zh_cn: GameMaker Studio 2 和 GameMaker Studio 1.4 之间存在很多差异，因此你的旧版项目可能需要一些调整之后才能运作。

source: A group cannot be a child of itself.
zh_cn: 一个组不可以是自身的子级。

source: A local push notification is local to the device that the game is installed on, and requires no backend server.
zh_cn: 本地通知由安装游戏的设备直接推送，并不需要后端服务器。

source: A parent reliant anchor (bottom or right) has been set with no parent gadget
zh_cn: 一个父依赖锚点（右底）已经被设置为没有父组件?

source: A parent reliant anchor (bottom or right) has been set with no parent gadget, try setting the dimension instead
zh_cn: 一个父依赖锚点 (底部或右部) 已被设置为没有父部件，作为替代，请尝试设置大小。

source: A physics shape cannot have more than 8 points.
zh_cn: 物理形状不能超过8个点。

source: A pointer is a data type that "points" to a memory location.
zh_cn: 指针是一个“指向”一个内存位置（Memory Location）的一种数据类型

source: A previous compile error has caused the compiler parse tree to not be created and thus the compiler has no program data to compile
zh_cn: 先前的编译错误导致编译器解析树无法创建，因此编译器没有要编译的程序数据

source: A script has been called that the compiler does not recognise (this error is usually thrown by empty script resource references since the compiler will strip out these resources on compile)
zh_cn: 调用了一个编译器无法识别的脚本（这个错误通常由空的脚本资源引用引发，因为编译器在编译时会删除这些资源）

source: A script resource is a collection of codes you have written to create your own function.
zh_cn: 脚本资源是一个你自己创建的功能函数的代码集合。

source: A self-contained loop structure with initialise, condition and increment statements.
zh_cn: 一个带有初值、条件和步进语句的完备的循环结构。

source: A signed, 8bit integer.
zh_cn: 一个有符号的8位整数。

source: A sprite like this is usually a PNG format file, but GameMaker Studio 2 will also accept vector sprites in SWF format, and Spine sprites in JSON (with their accompanying texture atlas file).
zh_cn: 像上图这样的精灵通常是一个 PNG 格式的文件，但是 GameMaker Studio 2 也兼容 SWF 格式的矢量精灵和 JSON 格式的 Spine 精灵（及其伴随的atlas条状图像）。

source: A step, is basically the loop that runs constantly with all the events being checked and triggered as necessary while the game runs, so as you can imagine, the Step Event is an event that is checked every single step of the game while the instance exists.
zh_cn: 一个步，是一个所有事件在游戏运行时被检查和触发的基础循环运行，所以你可以想到，步事件是一个每一步都会被检查和触发一遍的事件。

source: A string is simply any text that has been placed in quotation marks (either '...' or "...").
zh_cn: 一个字符串就是简单地使用引号（可以是'...'也可以是"..."）括起来的任意一段文本。

source: A texture ({1}x{2}) exceeds the maximum supported dimension ({3}x{3}) and cannot be loaded.
zh_cn: 纹理 ({1}x{2}) 超过最大支持的尺寸 ({3}x{3}) ，不能加载。

source: A tilemap layer is a layer that permits you to add tiles from any of the tile set resources that you have created and will be set up automatically to use a grid the size of the tile set cells.
zh_cn: 图块映射层是一个允许您从任何已创建的图块集资源添加图块的层，并将自动设置为使用图块集单元格大小的网格。

source: A typical object with events and code will look like this:
zh_cn: 一个具有事件和代码的典型物体如下图所示：

source: A value in milliseconds
zh_cn: 以毫秒为单位

source: A value of 0 (or a positive value) indicates a success(see below for exact values), and the “resultString” will contain the returned data or a success message.
zh_cn: 0 （或者大于0的值） 代表成功(见下文)的返回, “resultString” 中包含返回的消息数据。

source: A view with this name already exists.
zh_cn: 已经存在此名称的视图。

source: A/B Testing Using The Command Line
zh_cn: 使用命令行进行 A/B 测试

source: AC power framerate (%)
zh_cn: 使用交流电源时帧率(%)

source: ADB Path on Mac
zh_cn: Mac 上的 ADB 路径

source: AUDIO
zh_cn: 音频函数

source: AVAILABLE
zh_cn: 可用

source: Abort Errors
zh_cn: 异常中止错误

source: About
zh_cn: 关于

source: About GameMaker Studio 2
zh_cn: 关于GameMaker Studio 2

source: Above Objects
zh_cn: 物体上方

source: Above is an example sprite that would be used as a tile set to create walls.
zh_cn: 上图是一个示例精灵，被用作绘制墙壁的图块集。

source: Above you can see all the different Event Categories, some of which contain other sub-categories.
zh_cn: 在下面的图片中，您可以看到所有的 事件类别，其中一些还包含子类别。

source: Accept Spine licence
zh_cn: 接受 Spine 许可证

source: Accessors
zh_cn: 访问器

source: Account
zh_cn: 帐户

source: Acquire this demo
zh_cn: 获取这个演示项目

source: Acquire this tutorial
zh_cn: 获取本教程

source: Action Block Scripts
zh_cn: 动作脚本块

source: Action Block Workspace
zh_cn: 动作块工作区

source: Action Bottom
zh_cn: 底部动作键

source: Action Expansion
zh_cn: 扩增动作

source: Action Left
zh_cn: 左边动作键

source: Action Overview
zh_cn: 动作概述

source: Action Properties
zh_cn: 动作属性

source: Action Right
zh_cn: 右部动作键

source: Action Scope
zh_cn: 动作作用域

source: Action Syntax:
zh_cn: 动作语法：

source: Action Top
zh_cn: 顶部动作键

source: Actions
zh_cn: 动作

source: Actions can't be parents.
zh_cn: 动作不能作为父级。

source: Active Tabs
zh_cn: 活动选项卡

source: Active Windows
zh_cn: 活动窗口

source: Active connection to game
zh_cn: 与游戏的活动连接

source: Add
zh_cn: 添加

source: Add -->
zh_cn: 增加 -->

source: Add 16 Tile Set
zh_cn: 添加16块类型图块集

source: Add 47 Tile Set
zh_cn: 添加47块类型图块集

source: Add All
zh_cn: 全部添加

source: Add Android SDK
zh_cn: 添加 Android SDK

source: Add Anim
zh_cn: 添加动画

source: Add Animation
zh_cn: 添加动画

source: Add Argument
zh_cn: 添加参数

source: Add Child Node
zh_cn: 添加子节点

source: Add Context Menu
zh_cn: 添加右键菜单项

source: Add Device
zh_cn: 添加设备

source: Add Event
zh_cn: 添加事件

source: Add Existing
zh_cn: 添加现有资源

source: Add Existing Failed
zh_cn: 添加现有的失败

source: Add Existing From My Library
zh_cn: 从我的库中添加现有资源

source: Add File
zh_cn: 添加文件

source: Add Folder Containing Android Source files
zh_cn: 添加包含Android源文件的文件夹

source: Add Frame
zh_cn: 添加帧

source: Add From Default View
zh_cn: 从默认的视野中添加

source: Add Function
zh_cn: 添加函数

source: Add GML Placeholder
zh_cn: 添加 GML 占位符

source: Add Generic Placeholder
zh_cn: 添加通用占位符

source: Add Group
zh_cn: 添加组

source: Add JS Placeholder
zh_cn: 添加 JS 占位符

source: Add Layer
zh_cn: 添加层

source: Add Layer Group
zh_cn: 添加图层组

source: Add Layer To All Frames
zh_cn: 将图层添加到所有帧

source: Add Layout Group
zh_cn: 添加布局组

source: Add Macro
zh_cn: 添加宏常量

source: Add Menu Bar Entry
zh_cn: 添加菜单栏项目

source: Add Menu Bar Entry After '{0}'
zh_cn: 在'{0}'后面添加菜单栏项目

source: Add Menu Bar Entry Before '{0}'
zh_cn: 在'{0}'前面添加菜单栏项目

source: Add Menu Entry
zh_cn: 添加菜单项

source: Add Menu Entry Above
zh_cn: 在上方添加菜单项

source: Add Menu Entry Below
zh_cn: 在下方添加菜单项

source: Add Menu Separator Above
zh_cn: 在上方添加菜单分隔符

source: Add Menu Separator Below
zh_cn: 在下方添加菜单分隔符

source: Add New
zh_cn: 新增

source: Add New Browser
zh_cn: 增加新的浏览器

source: Add New Configuration
zh_cn: 添加新的配置

source: Add New Device
zh_cn: 增加新设备

source: Add New Tab
zh_cn: 添加新的选项卡

source: Add New Tab After '{0}'
zh_cn: 在'{0}'后面添加新的选项卡

source: Add New View
zh_cn: 添加新的视图

source: Add Node
zh_cn: 添加节点

source: Add Node After
zh_cn: 在后面添加节点(?)

source: Add Node Before
zh_cn: 在前面添加节点

source: Add Path
zh_cn: 添加路径

source: Add Permission
zh_cn: 添加权限

source: Add Placeholder
zh_cn: 添加占位符

source: Add Proxy File
zh_cn: 添加代理文件

source: Add Range
zh_cn: 增加范围

source: Add Resource
zh_cn: 添加资源

source: Add SDK
zh_cn: 添加 SDK

source: Add SSH Keypair Authentication
zh_cn: 添加SSH密钥对身份验证

source: Add Section
zh_cn: 添加节

source: Add Source
zh_cn: 添加源（Source）

source: Add Sub Layer
zh_cn: 添加子层

source: Add Sub Menu Entry
zh_cn: 添加子菜单项

source: Add Sub Menu Entry Above
zh_cn: 在上方添加子菜单

source: Add Sub Menu Entry Below
zh_cn: 在下方添加子菜单项

source: Add To List
zh_cn: 添加到列表

source: Add User/Pass Authentication
zh_cn: 添加用户/密码身份验证

source: Add Watch
zh_cn: 添加监视变量

source: Add Worker
zh_cn: 添加工作者

source: Add a frame
zh_cn: 添加一帧

source: Add a moment to the timeline
zh_cn: 向时间轴添加一个时刻

source: Add a new animation
zh_cn: 添加一个新动画

source: Add a new frame onto the end of the frame list
zh_cn: 在帧列表末端添加新的一帧

source: Add a new list item
zh_cn: 添加一个新的列表项

source: Add a new variable
zh_cn: 添加一个新变量

source: Add a value to a list.
zh_cn: 将一个值添加到列表中。

source: Add an empty frame
zh_cn: 选择一个空白帧

source: Add bias to text selection to prevent line jumping
zh_cn: 为文本选择添加偏差以防止线条跳跃(?)

source: Add child
zh_cn: 添加子项

source: Add content to Included Files "TutorialContent" folder
zh_cn: 添加内容至内含文件的"TutorialContent" 文件夹

source: Add default event content
zh_cn: 添加默认的事件内容

source: Add default layers when creating a new room?
zh_cn: 创建新房间时添加默认的层吗？

source: Add default room layers
zh_cn: 添加默认房间层

source: Add files for the user to import to Included Files "TutorialResources" folder
zh_cn: 添加用户要导入的文件到内含文件的"TutorialResources"文件夹

source: Add group
zh_cn: 添加组

source: Add layer
zh_cn: 添加层

source: Add local source folder
zh_cn: 添加本地源文件的文件夹

source: Add new SSH Keypair Authentication
zh_cn: 添加新的 SSH 密钥对身份验证

source: Add new User/Pass Authentication
zh_cn: 添加新的用户/密码身份验证

source: Add new range
zh_cn: 添加新的范围

source: Add new view
zh_cn: 添加新的视图

source: Add new watch...
zh_cn: 添加新的监视内容...

source: Add one or more add-ons to this project
zh_cn: 添加更多的附加组件到项目中

source: Add or Remove resource
zh_cn: 添加或移去资源

source: Add secondary particle emissions to a particle type.
zh_cn: 为一个粒子类型添加次级发射粒子。

source: Add sound group
zh_cn: 添加音频组

source: Add system framework entry
zh_cn: 增加系统框架项

source: Add the following:
zh_cn: 添加如下内容：

source: Add third-party framework entry
zh_cn: 添加第三方框架项

source: Add-ons
zh_cn: 附加组件

source: Add/Open Event
zh_cn: 添加/打开事件

source: Add/remove a breakpoint to the line the cursor is on
zh_cn: 在光标所在行安插/移除一个断点

source: Added compatibility script '{0}'
zh_cn: 已添加兼容性脚本 '{0}'

source: Adding a sound is as simple as clicking the add sound button and then browsing in the file explorer that opens to the file you want t use.
zh_cn: 添加声音非常简单，只需单击 添加声音按钮，然后在打开的文件浏览器中浏览您要使用的文件。

source: Adding an event will open either the code editor or the Drag and Drop editor, depending what type of project you are creating.
zh_cn: 添加事件将打开代码编辑器或拖拽编辑器，具体取决于您创建的项目类型。

source: Adding something to the event tells GameMaker Studio 2 "I want to control what you draw for instances of this object" and it completely over-rides the default draw.
zh_cn: 向事件添加一些内容告诉 GameMaker Studio 2 “我想控制你为这个物体的实例绘制的内容”，它会完全覆盖默认的绘制。

source: Additional Information
zh_cn: 附加信息

source: Addon requires additional licences
zh_cn: 附加组件需要额外的许可证?

source: Addon verification failed.
zh_cn: 附加组件校验失败。

source: Addressing Variables in Other Instances
zh_cn: 访问其它实例的变量

source: Advanced
zh_cn: 高级

source: Advanced Array Functionality
zh_cn: 数组高级功能

source: Advertising Type
zh_cn: 广告类型

source: Affected frames have been removed from the sprite.
zh_cn: 已从精灵中删除受影响的帧。

source: After any updates have been installed, you will be required to supply the licence details for your YoYo Games Account (see here) before being able to use the product, meaning that the first time you use GameMaker Studio 2 you must have an internet connection.
zh_cn: 在所有更新都安装后，在使用产品之前你将会被要求为你的YoYoGames 账户（参见这这里）提供许可的详细信息，这意味着初次使用GameMaker Studio 2的时候，你必须联网

source: After building a package highlight it in an explorer window
zh_cn: 创建包后在资源管理器窗口中高亮显示。

source: After having created a tile set, you need to add the tiles to your room, which is done by creating a tilemap layer.
zh_cn: 在创建了一个图块集之后，您需要将图块添加到您的房间，此行为是通过创建一个图块映射层来完成的。

source: After logging in and starting a new project, GameMaker Studio 2 will take you to the initial workspace with some basic windows docked to the IDE.
zh_cn: 登录并开启一个新项目之后, GameMaker Studio 2 会带你到最开始的 工作区 ，一些基本的窗口停靠在 IDE上.

source: After setting up the Merge Tool, you can then set up the User Identity with these options:
zh_cn: 设置完合并工具后，你可以使用这些选项设置用户身份（User Identity）：

source: After setting up the User Identity, you can then add a new username/password combination for authentication by clicking the button labelled Add new User/Pass authentication, which will open the following window with different fields for you to fill in:
zh_cn: 设置好用户身份后，您可以通过点击添加新用户/通过认证的按钮添加新的用户名/密码组合进行身份验证，这将打开以下窗口，您可以在此填写字段。

source: After the initial login, you should be able to use the product offline, however it will periodically require that you connect to verify the login account.
zh_cn: 经过初始登录后，你应该就可以离线地使用本产品了，但是它会定期地要求你联网来验证登录账户。

source: Again, all the bits move on one, and that multiples by 2.
zh_cn: 所有的位都左移 1 位，这是乘以 2 的情况。

source: Age Rating:
zh_cn: 年龄评级：

source: Alarm
zh_cn: 计时器

source: Alarm 0
zh_cn: 计时器 0

source: Alarm 1
zh_cn: 计时器 1

source: Alarm 10
zh_cn: 计时器 10

source: Alarm 11
zh_cn: 计时器 11

source: Alarm 2
zh_cn: 计时器 2

source: Alarm 3
zh_cn: 计时器 3

source: Alarm 4
zh_cn: 计时器 4

source: Alarm 5
zh_cn: 计时器 5

source: Alarm 6
zh_cn: 计时器 6

source: Alarm 7
zh_cn: 计时器 7

source: Alarm 8
zh_cn: 计时器 8

source: Alarm 9
zh_cn: 计时器 9

source: Alarm event
zh_cn: 计时器事件

source: Alarm {0}
zh_cn: 计时器 {0}

source: Alias
zh_cn: 别名

source: Alias Password
zh_cn: 别名密码

source: Alias must be longer than 5 characters
zh_cn: 别名必须超过5个字符

source: Alias password must be longer than 5 characters
zh_cn: 别名密码必须长于5个字符

source: Alignment: {0}
zh_cn: 对齐: {0}

source: All
zh_cn: 所有

source: All Assets
zh_cn: 所有资产

source: All Files
zh_cn: 所有文件

source: All Frames
zh_cn: 所有帧

source: All Instances
zh_cn: 所有实例

source: All Layers
zh_cn: 所有层

source: All Supported File Types
zh_cn: 所有支持的文件类型

source: All cells within the grid will then contain this value, which can be a real number or a string.
zh_cn: 所有在这个栅格中的单元格接下来都会包含这个值，可以是一个实数或者一个字符串。

source: All games have to have sound effects, and most also have music, which means that you need to be able to add them to your game in GameMaker Studio 2.
zh_cn: 所有游戏都必须有音效，大多数游戏还有音乐，这意味着你需要在 GameMaker Studio 2 中为游戏添加音效以及音乐。

source: All games that you make in GameMaker Studio 2 need at least one room to run (but can have many, many more) , and a room is basically a space where you place instances of the objects that make up your game and where the action of the game will take place.
zh_cn: 您在 GameMaker Studio 2 中所做的游戏至少需要一个空间来运行（当然可以不止一个），一个房间是一个基础空间，您可以在其中放置组成游戏的物体的实例，这里也是实例的事件触发和实现的场所。
